locallink/backend-node/loadtest.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Sustained load of 100 VUs per second over 1 minute"
scenarios:
  - name: "Health Check and Product Browse"
    flow:
      - get:
          url: "/api/health"
      - get:
          url: "/api/products"